/*
 * printf_redirect.c
 *
 *  Created on: 2025年6月23日
 *      Author: zhangjie
 */
#include "printf_redirect.h"


#if PRINTF_OUTPUT_TYPE == 0
//-------------------------------------------------------------------------------------------------------------------
//  函数简介      重定向 printf 到 指定端口
//  参数说明      buf     数据流
//  参数说明      len     数据长度
//  备注信息       此函数由编译器自带库里的printf所调用
//-------------------------------------------------------------------------------------------------------------------
int fputc(int ch, FILE *stream)
{
    uart_write_byte(DEBUG_UART_INDEX, (char)ch);

    return (ch);
}
#else
//-------------------------------------------------------------------------------------------------------------------
//  函数简介      重定向 printf 到 指定端口
//  参数说明      buf     数据流
//  参数说明      len     数据长度
//  备注信息       此函数由编译器自带库里的printf所调用
//-------------------------------------------------------------------------------------------------------------------
int _write(int fd, char *buf, int len)
{
    wifi_spi_send_buffer((uint8 *)buf, len);

    return len;
}
#endif

//-------------------------------------------------------------------------------------------------------------------
//  函数简介      重定向 scanf 到 指定端口
//  备注信息      此函数由编译器自带库里的scanf所调用
//-------------------------------------------------------------------------------------------------------------------
int fgetc(FILE *f)
{
#if PRINTF_OUTPUT_TYPE == 0
    return uart_read_byte(DEBUG_UART_INDEX);
#else
    uint8 buf;
    wifi_spi_read_buffer(&buf, 1);
    return buf;
#endif
}



